# Задача 10: На столе лежат n монеток.
# Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть

# n=int(input("Введите кол-во монеток: "))
# x=0
# y=0
# for i in range(n):
#     z=int(input("Решка введите -0, Герб введите-1: "))
#     if z==0:
#         x+=1
#     else:
#         y+=1
# if x<y:
#     print(f"Нужно перевернуть: {x}")
# elif x==y:
#     print(f"Количество одинаковое: {x}")
# else:
#     print(f"Нужно перевернуть {y}")


# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих
# чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

# x = int(input("Первое число от 1 до 1000: "))
# y = int(input("Второе число от 1 до 1000: "))
# s = x+y
# p = x*y
# x1 = int((s-((-s)**2-4*p)**0.5)/2)
# y1 = int((s+((-s)**2-4*p)**0.5)/2)
# print(f"Петя загадал {x1}, {y1}")


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа
# вида 2k
# ), не превосходящие числа N.

n=int(input("Введите число: "))
k=1
while k<=n:
    print(k, end=" ")
    k=k*2